src/BusinessProcesses/ЗакупкаУПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<BusinessProcess>
		<Properties>
			<Name>ЗакупкаУПоставщика</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаПодтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/BusinessProcesses/ЗакупкаУПоставщика/Ext/ObjectModule.bsl
Процедура ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ФормируемаяЗадачи Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадачи.Наименование  = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " (Закупка товара: " + Номенклатура.Наименование +")";
	КонецЦикла;
КонецПроцедуры

Процедура ОплатаПоставщикуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	БизнесПроцесс = Задача.БизнесПроцесс;
	ДиагностикаКлиентСервер.Утверждение(ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ЗакупкаУПоставщика.ТочкиМаршрута.ОплатаПоставщику);
	
	Отказ =  НЕ ЗначениеЗаполнено(Задача.ОплатаПоставщику);
	Если Отказ = Истина Тогда
		Сообщить("Создайте документ ""Расход денежных средств"" и укажите его в задаче! ");
	Иначе
		БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
		БизнесПроцессОбъект.ОплатаПоставщику = Задача.ОплатаПоставщику;
		БизнесПроцессОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоставкаПодтвержденаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПоставкаПодтверждена;
КонецПроцедуры
